import java.util.*;

public class PrizeStand extends HauntedCarnival {

	public PrizeStand(double d, String[] inventory1) {
		
		super(d, inventory1);
	}

	Random rand = new Random();
	Scanner sc = new Scanner(System.in);
	
	public void moneyAsk(double d) {
		String userInput;
		System.out.println("Would you like to call your mom for more money?Y/N");
		userInput = sc.nextLine();
		
		if(userInput.equals("Y")) {
			System.out.println("Great lets see what she says!");
			int randInput;
			
			randInput = rand.nextInt(2)+ 1;
			
			if(randInput == 1) {
				System.out.println("Congrats your mom said yes, you have now been given 100 more dollars!");
				d = d + 100; 
			} else {
				System.out.println("Your mom said no, you have been given no money!");
			}
		}else {
			 System.out.println("Continue at the carnival!");
		}
	}
	
	public void toys(String[] inventory1) {
		String plushInput;
		System.out.println("Welcome to the Plushy Store!" + "/n Here you have many options, from cute plushies, to SCARY ones! The plushys cost 20$ each");
		System.out.println("Would you like to buy plushies? Y/N");
		plushInput = sc.nextLine();
		
		if(plushInput.equals("Y")) {
			System.out.println("Great here are your options!" 
					+ "\n 1. Panda Plushy" 
					+ "\n 2. Turtle Plushy" 
					+ "\n 3. Scary Spider Plushy"
					+ "\n 4. Pumpkin Plushy"
					+ "\n 5. Ghost");
			
			System.out.println("Now you get to choose which plushy you want! Use the numbers 1-5 to choose which teady fits you best!");
			
			int plushChoice;
			
			if(plushChoice == 1) {
				String panda = ("You picked the Panda Plushy!" + "\n Collect your prize:"
						+ "		System.out.println(\"â €â €â €â €â €â €â €â €â£€â£€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â €â €â €â£°â£¿â£¿â£¿â£¿â£¦â£€â£€â£€â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â €â €â €â¢¿â£¿â Ÿâ ‹â ‰â €â €â €â €â ‰â ‘â ¢â£„â¡€â €â €â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â €â €â¢ â žâ �â €â €â €â €â €â €â €â €â €â €â €â ™â¢¿â£¿â£¿â£¦â¡€\\r\\n\"\r\n"
						+ "				+ \"â €â£€â €â €â¢€â¡�â €â¢€â£´â£¶â£¶â¡„â €â €â €â €â €â €â €â €â €â¢»â£¿â£¿â ‡\\r\\n\"\r\n"
						+ "				+ \"â£¾â£¿â£¿â£¦â£¼â¡€â €â¢ºâ£¿â£¿â¡¿â ƒâ €â €â €â €â£ â£¤â£„â €â €â ˆâ¡¿â ‹â €\\r\\n\"\r\n"
						+ "				+ \"â¢¿â£¿â£¿â£¿â£¿â£‡â €â ¤â Œâ �â €â¡€â¢²â¡¶â „â¢¸â£�â£¿â£¿â €â €â €â¡‡â €â €\\r\\n\"\r\n"
						+ "				+ \"â ˆâ¢¿â£¿â£¿â£¿â£¿â£·â£„â¡€â €â €â ˆâ ‰â “â ‚â €â ™â ›â ›â  â €â¡¸â �â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â »â£¿â£¿â£¿â£¿â£¿â£¿â£·â£¦â£„â£€â €â €â €â €â ‘â €â£ â žâ �â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â¢¸â¡�â ‰â ›â ›â ›â ¿â ¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡„â €â €â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â ¸â €â €â €â €â €â €â €â €â ˆâ ‰â ›â¢¿â£¿â£¿â£¿â£¿â¡„â €â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â¢·â €â €â €â €â €â €â €â €â €â €â €â ˆâ¢»â£¿â£¿â£¿â£¿â¡€â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â¢¸â£†â €â €â €â €â €â €â €â €â €â €â €â €â£¿â£¿â£¿â£¿â¡‡â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â¢¸â£¿â£¦â£€â €â €â €â €â €â €â €â €â¢€â£¼â¡Ÿâ »â ¿â Ÿâ €â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â €â£¿â£¿â£¿â£¿â£¶â ¶â ¤â ¤â¢¤â£¶â£¾â£¿â£¿â¡‡â €â €â €â €â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â €â ¹â£¿â£¿â£¿â �â €â €â €â ˆâ¢¿â£¿â£¿â¡¿â �â €â €â €â €â €â €â €\\r\\n\"\r\n"
						+ "				+ \"â €â €â €â €â €â ˆâ ‰â ‰â €â €â €â €â €â €â ‰â ‰â €â €â €â €â €â €â €â €â €\");");
				
				inventory1 = inventory1 + panda;
				
				
			}else if(plushChoice == 2) {
				String turtle = ("You picked the Turtle Plushy!" + "\n Collect your prize:"
			+ "					 â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£€â£€â£€â£€â£€â €â €â €â €\\r\\n\"\r\n"
			+ "				+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â¡´â Šâ �â €â €â €â €â ˆâ ™â¢¦â¡€â €\\r\\n\"\r\n"
			+ "				+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¡œâ €â €â €â €â €â €â €â €â €â €â¢³â €\\r\\n\"\r\n"
			+ "				+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¡‡â €â €â €â €â €â €â €â €â €â €â ˆâ¡‡\\r\\n\"\r\n"
			+ "				+ \"â €â €â €â €â €â €â €â£€â ¤â¢„â£€â €â €â €â¡‡â €â €â €â €â¢°â£¶â „â €â €â €â €â¡‡\\r\\n\"\r\n"
			+ "				+ \"â €â €â €â €â €â¡´â¡‹â €â €â €â¡¨â “â£„â €â¢³â €â €â €â €â €â ‰â €â €â €â¢€â¡¼â €\\r\\n\"\r\n"
			+ "				+ \"â €â €â €â¢€â¡žâ €â¢¸â “â ’â¢ºâ¡€â €â ˆâ¢£â ˆâ¡‡â €â €â €â €â €â¢ â¡¤â ´â ‹â €â €\\r\\n\"\r\n"
			+ "				+ \"â €â €â €â¡¼â ’â ’â¢�â €â €â €â ™â£¦â –â ‰â¢§â¡¿â €â ˆâ ™â¡–â šâ ‰â €â €â €â €â €\\r\\n\"\r\n"
			+ "				+ \"â €â €â¡–â¢§â¡€â €â ˆâ£¦â¡¤â ¤â Šâ¡�â£€â¡´â Šâ¡¹â €â£ â žâ €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "				+ \"â¢¶â¡žâ¡Ÿâ ¦â£Œâ¡“â ¾â ¥â ¤â ´â ’â ‹â£�â ´â¢Šâ£¤â žâ �â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "				+ \"â €â €â¡‡â €â €â¢‰â£™â£’â£’â£’â£šâ£‰â �â €â¢£â¡¤â ƒâ €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "				+ \"â €â €â ™â ’â ’â šâ ’â ‹â ‰â ‰â €â ˆâ “â šâ �â €â €â €â €â €â €â €â €â €â €â €â €\"");
				
				inventory1 = inventory1 + turtle;
				
			} else if(plushChoice == 3) {
				String spider = ("You picked the spider Plushy!" + "\n Collect your price:"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£€â €â¢°â ›â ‰â ³â¡€â €â €â €â €â¢€â£ â ¤â ´â ’â ’â ’â ’â ¤â£„â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢ â¡¾â ‰â ™â »â£§â €â €â¢³â¡€â €â£ â žâ ‰â €â €â €â €â €â €â €â €â €â ‰â¢³â£„â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â¡¤â ¶â¢»â¢·â£¤â¡€â €â ˆâ¢§â¡€â €â£·â žâ �â €â €â €â €â €â €â €â €â €â €â €â €â ˆâ ‰â¢£â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£°â ‹â €â €â¢¸â €â ™â¢¿â¡„â €â €â¢±â£´â ƒâ €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£‡â£ â ´â¡¶â£„â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â¡žâ �â£€â£€â£´â¡›â ³â£„â €â ™â£¦â£„â£ â£‡â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢¸â¢�â£´â¢§â¡ˆâ ³â£„â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â£€â¡´â£�â¢€â¡¼â �â¢¹â €â ‰â ‰â¢™â£³â¡¾â �â €â €â €â €â ‰â ™â ²â£„â €â €â €â €â €â €â €â €â €â €â €â €â¢€â¡¾â ‹â¡‡â €â ™â¢·â£Œâ “â¢„â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â¢€â¡¤â žâ �â €â£¨â �â €â£ â¡¼â ²â¡¶â£¶â ‹â¢¹â¡—â£¦â£€â£€â¡€â£€â£€â£¤â €â ˆâ¢³â¡€â €â¢€â£€â£€â €â¢€â¡žâ ‰â¢³â£¤â žâ �â¢ â �â ™â ¦â¡€â ™â¢§â šâ¢³â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â£ â¡´â šâ �â €â£€â£´â žâ �â£ â žâ¡¿â €â¢€â¡‡â ¸â£¤â£¸â¡¶â ¿â£‡â£¶â¡‡â »â ¿â €â €â €â €â¢¹â €â¡�â €â¢¹â¡„â¢¸â£§â €â ˜â¡�â €â¢ â �â €â €â €â ˆâ ³â£„â ±â¢¬â£§â¡€â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â£ â žâ �â£ â£¶â£¶â Ÿâ ‹â �â¢€â¡´â ƒâ£°â �â¢€â£¾â €â£ â Ÿâ ‹â¢³â¡¶â ›â¢¥â¡€â €â €â €â¡¤â¢¶â£¶â¡‹â ¸â¡‡â €â ˆâ£¿â¡Ÿâ¢¹â €â €â£¿â¡¶â ‹â €â €â €â €â €â €â ˆâ ³â£¾â£¿â£�â “â ¤â£„â €â €\r\n"
			+ "â €â €â¢€â¡¤â žâ �â£ â£¾â Ÿâ �â €â£ â¡¤â –â ‹â €â¢ â §â£„â¡žâ ˆâ¡¿â �â €â¢€â¡žâ €â €â €â£·â¡€â €â£¼â �â¢¸â£€â£¿â –â£‡â €â €â£¿â£¿â ¶â¡‡â €â¢¹â €â €â €â €â €â €â €â €â €â €â ™â¢�â ¹â£Ÿâ Šâ ‰â €â €\r\n"
			+ "â €â €â ˆâ “â ’â£»â ¿â ƒâ£ â –â ‹â �â €â €â €â£–â �â£ â �â €â¢¸â €â €â¢ â Žâ €â €â €â¡¾â �â ‰â¢‰â¡‡â €â¡œâ ‰â €â €â¢¸â €â €â¢»â �â €â£¼â €â ˆâ¡‡â €â €â €â €â €â €â €â €â €â €â ˆâ¢£â¡˜â¢¦â¡€â €â €\r\n"
			+ "â €â €â €â¡ â žâ¢�â£ â žâ �â €â €â €â €â €â €â ˆâ ‰â �â €â €â ˜â ·â ¤â¢¼â£€â €â €â£¼â ‡â €â¢€â¡žâ €â£¸â ƒâ €â €â €â €â¡‡â €â¢¸â €â €â¢¸â¡–â ’â¢»â €â €â €â €â €â €â €â €â €â €â €â €â ¹â£�â “â¢¤â£€\r\n"
			+ "â£¤â –â ‹â£€â ´â ‹â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ˆâ ‰â ‰â ‰â €â €â¡žâ €â¢ â ‡â €â €â €â €â €â¡·â ’â ºâ¡‡â €â €â£‡â €â¢¸â €â €â €â €â €â €â €â €â €â €â €â €â €â ˆâ ‘â ’â ’\r\n"
			+ "â ‰â ‰â ‰â �â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢ºâ£€â£€â¡¾â €â €â €â €â €â €â¢¸â €â €â¡‡â €â €â¢¿â €â¢¸â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ¸â£‡â €â¢¹â €â €â¢¸â¡„â£¸â¡„â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢¸â¡€â¢¸â €â €â¢¸â¡�â ‰â¡‡â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ˆâ£§â ¾â¡‡â €â ˜â¡‡â €â¢³â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢¿â €â¢³â €â €â ¹â£¤â£¼â ‡â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£¸â €â¢¸â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\r\n"
			+ "â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢�â£‡â£€â£¸â ‡â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €");
				
				inventory1 = inventory1 + spider;
			}else if(plushChoice == 4) {
				String pumpkin = ("You picked the Pumpkin plushy!" + "\n Collect your prize:" 
			+ "\"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£€â£€â£€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£€â¡¤â žâ ‰â �â €â ‰â ³â£¦â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ´â£žâ ‰â €â¢€â €â €â €â €â €â ˆâ ³â£„â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£¸â£„â£€â£ˆâ£³â¡„â €â£€â¡¤â ´â –â ºâ ·â¢¤â£¤â ¶â ’â ¶â ¤â£€â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£ â¢¶â£¾â£¿â£¿â£·â ¶â ¶â¢¿â¡¿â šâ �â €â €â €â €â €â €â ˆâ¢·â¡€â €â €â €â ‰â ³â¢¶â£¤â£„â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£°â£¿â£¿â£¿â žâ ‹â �â €â €â €â €â €â €â €â €â €â£€â£€â €â €â €â €â ¹â¡„â €â €â €â €â €â ‰â «â£Ÿâ¢¦â£„â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢°â¢¯â£¯â Ÿâ �â €â €â €â£ â †â €â €â €â €â €â €â¡¾â ‰â ˆâ¢»â €â €â €â €â¢³â €â €â¢ â¡–â ‹â ™â¢¦â ˆâ ƒâ ™â¢·â¡„â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£¿â¡¾â �â €â €â €â €â£°â ƒâ €â €â €â €â €â €â €â »â ¤â ´â Ÿâ €â €â €â €â¢¸â €â €â ˜â¢§â£€â£ â Ÿâ €â €â €â €â ™â£¦â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â¡Ÿâ €â €â €â €â €â£°â ƒâ €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ¸â €â €â €â €â €â €â €â €â €â €â¢³â €â ˜â£·â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£¸â �â €â €â €â €â¢ â ‡â €â €â €â €â¢ â –â ’â¢¦â£„â¡€â €â¢€â£¤â –â ’â¢¦â£€â €â €â €â €â£ â£¤â¡€â €â €â¢€â¡€â ˆâ£‡â €â ˜â£§â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢ â¡�â €â €â €â €â €â¡¼â €â €â €â €â €â£¼â£¿â£¦â£¤â£€â£©â£¿â£¿â£¿â£·â£¤â£€â ˆâ£“â£¦â£´â£¿â£�â €â ™â£¦â£¼â ‰â ¹â¡„â¢¸â¡„â €â¢¹â¡†\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢¸â ‡â €â €â €â €â €â¡‡â €â €â €â €â €â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡‡â €â¢³â ˆâ£‡â €â ˆâ£¿\\r\\n\"\r\n"
			+ "			+ \"â €â£€â£€â €â €â €â €â €â €â €â €â €â €â €â €â¢¸â €â €â €â €â €â €â¡‡â €â €â €â €â €â¢¿â£¿â£¿â£¿â¡¿â ¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡‡â €â¢¸â €â£¿â €â €â£¿\\r\\n\"\r\n"
			+ "			+ \"â �â£¿â ‰â¢·â ´â£¤â €â €â €â €â €â €â €â €â €â¢¸â¡†â €â €â €â €â €â¡‡â €â €â €â €â €â¢¸â¡Ÿâ ‰â €â €â €â €â ˆâ ‰â »â¢¿â£¿â£¿â£¿â ¿â ¿â ¿â¢¿â£¿â£¿â£¿â£¿â ƒâ¢€â¡�â €â£¿â €â €â£¿\\r\\n\"\r\n"
			+ "			+ \"â €â ™â£†â €â£„â ˆâ¢·â¢¶â¡„â €â €â €â €â €â €â¢¸â£§â €â €â €â €â €â¢·â €â €â €â €â €â €â¢·â¡€â €â €â €â €â €â €â €â €â ‰â �â €â €â €â €â €â ˆâ »â£¿â ‡â €â¡¼â �â¢€â¡¿â €â¢ â¡Ÿ\\r\\n\"\r\n"
			+ "			+ \"â €â£¾â �â €â ˆâ¢³â¡„â €â¢§â €â €â €â €â €â €â¡¼â£¿â¡„â €â €â €â €â¢¸â¡„â €â €â €â €â €â ˆâ¢·â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£´â ‹â €â£°â ƒâ €â£¸â¡‡â €â£¼â ƒ\\r\\n\"\r\n"
			+ "			+ \"â €â ˆâ ™â£¶â €â €â ¹â¡„â¡¾â €â €â €â €â¢€â¡¾â£¡â �â¢¿â£„â €â €â €â ˆâ£·â¡€â €â €â €â €â €â €â ™â ¶â ¶â ’â šâ ‹â ‰â ‰â ‰â ™â ’â ¶â¢¤â£„â£ â žâ �â¢€â¡¼â �â €â¢ â¡¿â €â£°â¡Ÿâ €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â ™â ²â ¤â ¤â¢¼â¡·â£¤â£€â£¤â –â£«â¡œâ �â €â ˆâ »â£§â¡€â €â €â ˜â£·â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¡¤â €â €â €â ‰â ‰â ‰â ‰â €â €â¢ â¡¿â �â£°â¡Ÿâ €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â ™â ²â ¶â –â ›â �â €â €â €â£ â¡¶â ›â¢¿â£¦â¡€â €â ˆâ¢·â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¡‡â €â €â €â €â €â €â €â €â¢ â¡¿â£¡â£¾â Ÿâ €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£´â ‹â €â €â €â ‰â£»â£¶â£¤â£€â£»â£¶â †â €â €â €â €â €â €â €â €â €â €â €â£¼â �â €â €â €â €â €â €â €â£ â£¿â£¿â£Ÿâ �â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â »â ¦â£¤â ¤â ´â šâ ‰â €â €â ‰â£¿â ƒâ €â €â €â €â €â €â €â €â €â €â¢€â¡¼â ƒâ €â €â €â €â£€â£ â£´â¡¾â ›â ‰â €â ˆâ¢³â£„â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¡¼â �â €â €â €â €â¢€â¡´â ¿â ¤â ¤â ´â –â ›â “â ’â ’â ’â šâ ›â ‰â �â ˆâ »â£¦â¡€â €â €â €â£¹â¡„â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ³â£„â£€â£€â¡¤â –â ‹â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ‰â ™â ’â ’â ‹â �â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£€â¡€â¢€â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\"");
				
				inventory1 = inventory1 + pumpkin;
				
			}else if(plushChoice ==5) {
				String ghost = ("You picked the ghost plushy!" + "\n collect your price:"
			+ "\n â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£ â£¤â£¶â£¶â£¶â£¶â£¶â£¶â£¤â£„â£€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£´â£¾â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¦â£„â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£¾â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£·â£„â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£°â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡¿â ¿â ¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£†â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â£°â£¿â£¿â£¿â£¿â£¿â£¿â£¿â ƒâ €â €â €â €â¢€â£½â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡„â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â¢ â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡¿â ¿â¢¿â£¿â£¿â£¿â£¿â¡�â ˆâ ›â¢¿â£¿â£¿â£¿â£·â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â¢€â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â �â €â €â €â €â ˆâ¢¹â£¿â¢·â£¢â¡€â €â¢™â£¿â£¿â£¿â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â£ â£¾â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â €â €â €â €â €â €â €â �â €â£¸â£¿â£¦â£¼â£¿â£¿â£¿â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â¢€â£´â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡„â €â €â €â €â €â €â €â£ â£¿â£¿â£¿â£¿â£¿â£¿â¡¿â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â  â£¶â£¤â£¤â£¤â£„â£¾â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¦â¡€â €â €â €â£€â£´â£¿â£¿â£¿â£¿â£¿â£¿â£¿â ƒâ €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â ˆâ¢¹â£¿â£¿â£¿â£¿â£¿â£¿â¢¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡Ÿâ €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â ‰â ‰â ‰â �â €â ˜â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡Ÿâ �â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£§â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â£»â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£·â£„â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â¢¹â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡¿â »â£¿â£¿â£¿â£¿â£¿â£¿â£¶â£¶â£¤â£¤â£¶â¡¶â ƒâ €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â ˜â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡�â €â €â €â ‰â ›â ¿â ¿â ¿â ¿â ¿â Ÿâ ‹â �â €â €â €â €â €â €â €â €â €â €â €â €â¢€â ´â œâ Šâ ›â ’â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â¢»â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡Ÿâ €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â¡”â �â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â ˆâ¢¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡‡â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢ â£´â¡Ÿâ €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â ˜â¢¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡‡â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â£¤â£¾â ‡â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â ˜â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£§â¡€â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â¢€â£µâ£¿â ‡â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ˆâ¢»â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¦â£€â €â €â €â €â €â €â €â €â €â €â €â €â €â£€â£ â£¾â£¿â£¿â �â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ™â¢¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£·â£¦â£¤â£€â£€â£€â£€â£€â¡€â €â£€â£ â£¼â£¿â£¿â£¿â£¿â ‹â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â »â¢¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â Ÿâ �â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ™â ¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â Ÿâ �â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ˆâ ™â ›â¢¿â¢¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â¡¿â ›â ‹â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\\r\\n\"\r\n"
			+ "			+ \"â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â ‰â ›â ›â ¿â ¿â ¿â ¿â ¿â ¿â ¿â ¿â ¿â ›â ›â ‰â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €â €\"");
				
			}
		}
		

		
	}
	
}

